{
  "_commit_hash": null,
  "_name_or_path": "None",
  "additional_vocab_size": 2,
  "alpha_initializer": "zeros",
  "alpha_type": "float",
  "alphas_initializer_range": 0.0,
  "architectures": [
    "VMistralForVisionText2Text"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_vmistral.VMistralConfig",
    "AutoModelForCausalLM": "modeling_vmistral.VMistralForVisionText2Text"
  },
  "bos_token_id": 1,
  "cross_layer_interval": 1,
  "eos_token_id": 2,
  "freeze_lm_head": false,
  "freeze_text_layers": false,
  "freeze_text_module_exceptions": [],
  "freeze_vision_layers": false,
  "freeze_vision_module_exceptions": [],
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_token_id": 32001,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,
  "model_type": "vmistral",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pad_token_id": 0,
  "perceiver_config": {
    "resampler_depth": 3,
    "resampler_head_dim": 96,
    "resampler_n_heads": 16,
    "resampler_n_latents": 64,
    "qk_layer_norms_perceiver": true
  },
  "qk_layer_norms": true,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.34.0.dev0",
  "use_cache": true,
  "use_resampler": true,
  "vision_config": {
    "hidden_size": 1152,
    "image_size": 960,
    "intermediate_size": 4304,
    "model_type": "vmistral",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "patch_size": 14
  },
  "vocab_size": 32000
}
